{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ADHD",
    "1": "Acne",
    "2": "Anxiety",
    "3": "Bipolar Disorde",
    "4": "Birth Control",
    "5": "Depression",
    "6": "Insomnia",
    "7": "Obesity",
    "8": "Pain",
    "9": "Weight Loss"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "ADHD": 0,
    "Acne": 1,
    "Anxiety": 2,
    "Bipolar Disorde": 3,
    "Birth Control": 4,
    "Depression": 5,
    "Insomnia": 6,
    "Obesity": 7,
    "Pain": 8,
    "Weight Loss": 9
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
